app/views/access_codes/index.html.haml

          %td
            - if access_code.attendees.length > 0
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."access_code_id" = $1  [["access_code_id", 4]]