app/controllers/access_codes_controller.rb

SELECT "access_codes".* FROM "access_codes" WHERE "access_codes"."user_id" = $1  [["user_id", 1]]
---
  def index
    #TODO: use auth here and elsewhere
    @user = current_user
    @code_allowance = @user.code_allowance
    @access_codes = AccessCode.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "access_codes" WHERE "access_codes"."user_id" = $1  [["user_id", 1]]
INSERT INTO "access_codes" ("user_id", "code", "eventbrite_access_code_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["code", "grapevodka3"], ["eventbrite_access_code_id", "161105441"], ["created_at", "2015-06-20 18:10:43.954913"], ["updated_at", "2015-06-20 18:10:43.954913"]]
---
  def create

    # Simplifies things to only take in lowercase codes
    code = access_code_params[:code].downcase
    user_id = current_user.id
    user = User.find(user_id)
    current_access_codes_count = user.access_codes.count
    access_code_allowance = user.code_allowance

    if current_access_codes_count >= access_code_allowance
      flash[:error] = 'You\'re past your access code allowance of %s.  Contact Ben or Andrew for another code.' % access_code_allowance
    else
      begin
        AccessCodesHelper.create_and_sync_access_code(code, user_id)

DELETE FROM "access_codes" WHERE "access_codes"."id" = $1  [["id", 5]]
---
  def destroy
    @access_code.destroy

SELECT  "access_codes".* FROM "access_codes" WHERE "access_codes"."code" = $1  ORDER BY "access_codes"."id" ASC LIMIT 1  [["code", "@*)#(*@#"]]
---
    def set_access_code
      @access_code = AccessCode.find(params[:id])