app/controllers/access_codes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
  def index
    #TODO: use auth here and elsewhere
    @user = User.find(1)