app/controllers/web_hooks_controller.rb

  def eventbrite
    api_url = params[:api_url]
    order_match = /https:\/\/www\.eventbriteapi\.com\/v\d+\/orders\/(\d+)\/?/i.match(api_url)
    if order_match
      eventbrite_order_id = order_match[1]

      eb = EventbriteAPI.new
      eventbrite_order = eb.get_order(eventbrite_order_id)
      eventbrite_event_id = eventbrite_order['event_id']

      eventbrite_order['attendees'].each do |attendee|
        attendee = eb.get_attendee(eventbrite_event_id, attendee['id'])
        event = Event.find_by_eventbrite_event_id(eventbrite_event_id)
        AttendeeHelper.sync_attendee(event, attendee)
---
INSERT INTO "attendees" ("access_code_id", "eventbrite_attendee_id", "name", "email", "ordered_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"